# AncillaryId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationAncillaryUsage..::..AncillaryId Property
FabricationAncillaryUsage Class See Also
---
Fabrication ancillary database identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public int AncillaryId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AncillaryId As Integer
	Get
```

Visual C++
---
```text
public:
property int AncillaryId {
	int get ();
}
```

# See Also
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace